Revit 2024 API
ProjectPosition Constructor (ProjectPosition)
 Creates a copy of the ProjectPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ProjectPosition(
	ProjectPosition other
)
Visual Basic
Public Sub New ( _
	other As ProjectPosition _
)
Visual C++
public:
ProjectPosition(
	ProjectPosition^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ProjectPosition
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ProjectPosition Class
ProjectPosition Overload
Autodesk.Revit.DB Namespace